In [48]:
import tensorflow as tf
from tensorflow import keras
from tensorflow.keras import Sequential
from tensorflow.keras.layers import Flatten, Dense

In [49]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split

In [50]:
dataset = pd.read_csv('Churn_Modelling.csv')

In [51]:
dataset.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [52]:
X = dataset.drop(labels=['CustomerId', 'Surname', 'RowNumber', 'Exited'], axis = 1)
y = dataset['Exited']

In [53]:
from sklearn.preprocessing import LabelEncoder
label1 = LabelEncoder()
X['Geography'] = label1.fit_transform(X['Geography'])
label = LabelEncoder()
X['Gender'] = label.fit_transform(X['Gender'])
X.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,619,0,0,42,2,0.00,1,1,1,101348.88
1,608,2,0,41,1,83807.86,1,0,1,112542.58
2,502,0,0,42,8,159660.80,3,1,0,113931.57
3,699,0,0,39,1,0.00,2,0,0,93826.63
4,850,2,0,43,2,125510.82,1,1,1,79084.10

In [54]:
X = pd.get_dummies(X, drop_first=True, columns=['Geography'])
X.head()

,CreditScore,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Geography_1,Geography_2
0,619,0,42,2,0.00,1,1,1,101348.88,False,False
1,608,0,41,1,83807.86,1,0,1,112542.58,False,True
2,502,0,42,8,159660.80,3,1,0,113931.57,False,False
3,699,0,39,1,0.00,2,0,0,93826.63,False,False
4,850,0,43,2,125510.82,1,1,1,79084.10,False,True

In [55]:
X = pd.get_dummies(X, drop_first=True, columns=['Tenure'])
X.head()

,CreditScore,Gender,Age,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Geography_1,Geography_2,Tenure_1,Tenure_2,Tenure_3,Tenure_4,Tenure_5,Tenure_6,Tenure_7,Tenure_8,Tenure_9,Tenure_10
0,619,0,42,0.00,1,1,1,101348.88,False,False,False,True,False,False,False,False,False,False,False,False
1,608,0,41,83807.86,1,0,1,112542.58,False,True,True,False,False,False,False,False,False,False,False,False
2,502,0,42,159660.80,3,1,0,113931.57,False,False,False,False,False,False,False,False,False,True,False,False
3,699,0,39,0.00,2,0,0,93826.63,False,False,True,False,False,False,False,False,False,False,False,False
4,850,0,43,125510.82,1,1,1,79084.10,False,True,False,True,False,False,False,False,False,False,False,False

In [56]:
X = pd.get_dummies(X, drop_first=True, columns=['NumOfProducts'])
X.head()

,CreditScore,Gender,Age,Balance,HasCrCard,IsActiveMember,EstimatedSalary,Geography_1,Geography_2,Tenure_1,...,Tenure_4,Tenure_5,Tenure_6,Tenure_7,Tenure_8,Tenure_9,Tenure_10,NumOfProducts_2,NumOfProducts_3,NumOfProducts_4
0,619,0,42,0.00,1,1,101348.88,False,False,False,...,False,False,False,False,False,False,False,False,False,False
1,608,0,41,83807.86,0,1,112542.58,False,True,True,...,False,False,False,False,False,False,False,False,False,False
2,502,0,42,159660.80,1,0,113931.57,False,False,False,...,False,False,False,False,True,False,False,False,True,False
3,699,0,39,0.00,0,0,93826.63,False,False,True,...,False,False,False,False,False,False,False,True,False,False
4,850,0,43,125510.82,1,1,79084.10,False,True,False,...,False,False,False,False,False,False,False,False,False,False

In [57]:
X = pd.get_dummies(X, drop_first=True, columns=['HasCrCard'])
X.head()

,CreditScore,Gender,Age,Balance,IsActiveMember,EstimatedSalary,Geography_1,Geography_2,Tenure_1,Tenure_2,...,Tenure_5,Tenure_6,Tenure_7,Tenure_8,Tenure_9,Tenure_10,NumOfProducts_2,NumOfProducts_3,NumOfProducts_4,HasCrCard_1
0,619,0,42,0.00,1,101348.88,False,False,False,True,...,False,False,False,False,False,False,False,False,False,True
1,608,0,41,83807.86,1,112542.58,False,True,True,False,...,False,False,False,False,False,False,False,False,False,False
2,502,0,42,159660.80,0,113931.57,False,False,False,False,...,False,False,False,True,False,False,False,True,False,True
3,699,0,39,0.00,0,93826.63,False,False,True,False,...,False,False,False,False,False,False,True,False,False,False
4,850,0,43,125510.82,1,79084.10,False,True,False,True,...,False,False,False,False,False,False,False,False,False,True

In [58]:
from sklearn.preprocessing import StandardScaler
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 0, stratify = y)

In [59]:
scaler = StandardScaler()
X_train = scaler.fit_transform(X_train)
X_test = scaler.transform(X_test)

In [60]:
model = Sequential()
model.add(Dense(X.shape[1], activation='relu', input_dim = X.shape[1]))
model.add(Dense(128, activation='relu'))
model.add(Dense(1, activation = 'sigmoid'))

In [61]:
model.compile(optimizer='adam', loss = 'binary_crossentropy', metrics=['accuracy'])
model.fit(X_train, y_train.to_numpy(), batch_size = 10, epochs = 10, verbose = 1)

Epoch 1/10
800/800 [==============================] - 1s 627us/step - loss: 0.4133 - accuracy: 0.8250
Epoch 2/10
800/800 [==============================] - 1s 648us/step - loss: 0.3664 - accuracy: 0.8499
Epoch 3/10
800/800 [==============================] - 1s 655us/step - loss: 0.3522 - accuracy: 0.8540
Epoch 4/10
800/800 [==============================] - 0s 620us/step - loss: 0.3445 - accuracy: 0.8602
Epoch 5/10
800/800 [==============================] - 0s 606us/step - loss: 0.3379 - accuracy: 0.8626
Epoch 6/10
800/800 [==============================] - 0s 602us/step - loss: 0.3336 - accuracy: 0.8651
Epoch 7/10
800/800 [==============================] - 0s 602us/step - loss: 0.3275 - accuracy: 0.8687
Epoch 8/10
800/800 [==============================] - 0s 604us/step - loss: 0.3248 - accuracy: 0.8684
Epoch 9/10
800/800 [==============================] - 0s 606us/step - loss: 0.3213 - accuracy: 0.8700
Epoch 10/10
800/800 [==============================] - 0s 600us/step - loss: 0.3168 - accuracy: 0.8712

In [62]:
y_pred = model.predict(X_test)
y_pred = y_pred.astype(np.int32)
y_pred

63/63 [==============================] - 0s 520us/step

array([[0],
       [0],
       [0],
       ...,
       [0],
       [0],
       [0]])

In [63]:
model.evaluate(X_test, y_test.to_numpy())

63/63 [==============================] - 0s 631us/step - loss: 0.3579 - accuracy: 0.8580

[0.3579392731189728, 0.8579999804496765]

In [64]:
from sklearn.metrics import confusion_matrix, accuracy_score
confusion_matrix(y_test, y_pred)

array([[1593,    0],
       [ 407,    0]], dtype=int64)